home/files/doom/config.org
* ~general~
#+begin_src emacs-lisp
(use-package! general)
#+end_src
* miscellaneous
** ben’s variables
#+begin_src emacs-lisp
(setq ben/org-dir "~/org"
      ben/ref-dir (concat ben/org-dir "/ref")
      ben/bib (concat ben/ref-dir "/bib.bib")
      ben/papers (concat ben/ref-dir "/papers")
      ben/notes (concat ben/ref-dir "/notes"))
#+end_src
** ben’s functions
#+begin_src emacs-lisp
(defun ben/org-select-bullet-body ()
  (interactive)
  (beginning-of-line)
  (when (search-forward-regexp "^ ?+-" (line-end-position) t)
    (forward-char)
    (set-mark-command nil)
    (end-of-line)
    (backward-char)))

;; stolen from https://hungyi.net/posts/copy-org-mode-url/
(defun ben/org-yank-link ()
  (interactive)
  (let ((plain-url (url-get-url-at-point)))
    (if plain-url
        (progn
          (kill-new plain-url)
          (message (concat "Copied: " plain-url)))
      (let* ((link-info (assoc :link (org-context)))
             (text (when link-info
                     (buffer-substring-no-properties
                      (or (cadr link-info) (point-min))
                      (or (caddr link-info) (point-max))))))
        (if (not text)
            (error "Oops! Point isn't in an org link")
          (string-match org-link-bracket-re text)
          (let ((url (substring text (match-beginning 1) (match-end 1))))
            (kill-new url)
            (message (concat "Copied: " url))))))))

(defun ben/org-cliplink-without-domain-name ()
  (interactive)
  (org-cliplink-insert-transformed-title
   (org-cliplink-clipboard-content)  ;; take the URL from the clipboard
   (lambda (url title)
     (let* ((parsed-url (url-generic-parse-url url)) ;; parse the url
            (clean-title (replace-regexp-in-string ".*?: \\(.*\\)" "\\1" title)))
       ;; forward the title to the default org-cliplink transformer
       (org-cliplink-org-mode-link-transformer url clean-title)))))

(defun ben/evil-select-pasted ()
  (interactive)
  (let ((start-marker (evil-get-marker ?\[))
        (end-marker (evil-get-marker ?\])))
        (evil-visual-select start-marker end-marker)))

#+end_src
** Auto +x script files
#+begin_src emacs-lisp
(add-hook 'after-save-hook
  'executable-make-buffer-file-executable-if-script-p)
#+end_src
** bindings
#+begin_src emacs-lisp
(map! :leader
      :desc "Open inbox"
      "n i" (lambda () (interactive) (find-file (concat ben/org-dir "/inbox.org"))))

(map! :leader
      :desc "Open routine"
      "n R" (lambda () (interactive) (find-file (concat ben/org-dir "/routine.org"))))

(map! :leader
      :desc "Select pasted region"
      "v" #'ben/evil-select-pasted)
#+end_src
** save bookmarks every add/delete
#+begin_src emacs-lisp
(setq bookmark-save-flag 1)
#+end_src
** delete text when selecting and typing over it
#+begin_src emacs-lisp
(setq delete-selection-mode t)
#+end_src
** global auto revert
#+begin_src emacs-lisp
(global-auto-revert-mode)
(setq global-auto-revert-non-file-buffers t)
#+end_src
** Trash instead of delete
#+begin_src emacs-lisp
(setq delete-by-moving-to-trash t)
#+end_src
** meta
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets. It is optional.
#+begin_src emacs-lisp
(setq user-full-name "Ben Juntilla"
      user-mail-address "benthejun@gmail.com")
#+end_src
* org
** vars
#+begin_src emacs-lisp
(after! org
  (add-to-list 'org-tags-exclude-from-inheritance "todo")
  (setq org-root-dir "~/org"
        org-ref-dir (concat org-root-dir "/ref")
        org-directory "~/org"
        org-roam-directory "~/org"
        org-hide-drawer-startup nil
        org-cite-global-bibliography `(,ben/bib)
        org-use-property-inheritance t
        org-attach-method 'mv
        org-attach-use-inheritance t
        org-attach-store-link-p 'attached
        org-attach-directory "~/org/attach"
        org-attach-auto-tag nil
        org-roam-extract-new-file-path "${slug}.org"
        org-enforce-todo-checkbox-dependencies t
        org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "WAIT(w@/!)" "|" "DONE(d)" "CANC(c@)"))
        org-todo-keyword-faces '(("[-]" . +org-todo-active)
                                 ("NEXT" . +org-todo-active)
                                 ("STRT" . +org-todo-active)
                                 ("[?]" . +org-todo-onhold)
                                 ("WAIT" . +org-todo-onhold)
                                 ("HOLD" . +org-todo-onhold)
                                 ("PROJ" . +org-todo-project)
                                 ("NO" . +org-todo-cancel)
                                 ("CANC" . +org-todo-cancel))
        org-file-apps '((remote . emacs) (auto-mode . emacs) (directory . system) ("\\.mm\\'" . default)
                        ("\\.x?html?\\'" . default) ("\\.pdf\\'" . default))
        org-capture-templates '(("b" "Bookmark" entry (file+headline "~/org/inbox.org" "Reading List")
                                 "* TODO %(org-cliplink-capture) %?")
                                ("t" "Todo" entry (file "~/org/inbox.org")
                                 "* TODO %?" :prepend :jump-to-captured))
        org-roam-capture-templates '(("d" "default" plain "%?"
                                      :if-new (file+head "${slug}.org" "#+title: ${title}\n#+filetags: %^{prompt|personal|technology|politics}\n\n")
                                      :unnarrowed t)
                                     ("r" "ravenfield" plain "%?"
                                      :if-new (file+head "${slug}.org" "#+title: ${title}\n#+filetags: ravenfield\n\n* Tasks\n\n* Current Changelog")
                                      :unnarrowed t))))

#+end_src
** hooks
#+begin_src emacs-lisp
(defun my/org-modes ()
  (interactive)
  (adaptive-wrap-prefix-mode)
  (olivetti-mode)
  (mixed-pitch-mode))
(add-hook! 'org-mode-hook #'my/org-modes)
(add-hook! 'org-mode-hook #'org-appear-mode)
#+end_src
** [[https://d12frosted.io/posts/2021-01-16-task-management-with-roam-vol5.html][Boris Buliga - Task management with org-roam Vol. 5: Dynamic and fast agenda]]
#+begin_src emacs-lisp
(defun vulpea-todo-p ()
  "Return non-nil if current buffer has any todo entry.

TODO entries marked as done are ignored, meaning the this
function returns nil if current buffer contains only completed
tasks."
  (seq-find                                 ; (3)
   (lambda (type)
     (eq type 'todo))
   (org-element-map                         ; (2)
       (org-element-parse-buffer 'headline) ; (1)
       'headline
     (lambda (h)
       (org-element-property :todo-type h)))))

(defun vulpea-todo-update-tag ()
    "Update TODO tag in the current buffer."
    (when (and (not (active-minibuffer-window))
               (vulpea-buffer-p))
      (save-excursion
        (goto-char (point-min))
        (let* ((tags (vulpea-buffer-tags-get))
               (original-tags tags))
          (if (vulpea-todo-p)
              (setq tags (cons "todo" tags))
            (setq tags (remove "todo" tags)))

          ;; cleanup duplicates
          (setq tags (seq-uniq tags))

          ;; update tags if changed
          (when (or (seq-difference tags original-tags)
                    (seq-difference original-tags tags))
            (apply #'vulpea-buffer-tags-set tags))))))

(defun vulpea-buffer-p ()
  "Return non-nil if the currently visited buffer is a note."
  (and buffer-file-name
       (string-prefix-p
        (expand-file-name (file-name-as-directory org-roam-directory))
        (file-name-directory buffer-file-name))))

(defun vulpea-todo-files ()
    "Return a list of note files containing 'todo' tag." ;
    (seq-uniq
     (seq-map
      #'car
      (org-roam-db-query
       [:select [nodes:file]
        :from tags
        :left-join nodes
        :on (= tags:node-id nodes:id)
        :where (like tag (quote "%\"todo\"%"))]))))

(defun vulpea-agenda-files-update (&rest _)
  "Update the value of `org-agenda-files'."
  (setq org-agenda-files (vulpea-todo-files)))

(add-hook 'find-file-hook #'vulpea-todo-update-tag)
(add-hook 'before-save-hook #'vulpea-todo-update-tag)

(advice-add 'org-agenda :before #'vulpea-agenda-files-update)
(advice-add 'org-todo-list :before #'vulpea-agenda-files-update)
#+end_src
** ~org-agenda~
