home/files/doom/config.org
*** custom commands
Adapted from [[https://stackoverflow.com/a/17004389/13304045][How do I view all org-mode TODOs that are not recurring, or not scheduled?]]
#+begin_src emacs-lisp
(after! org-agenda
  (add-to-list 'org-agenda-custom-commands
    '("u" "TODOs with no set schedule or deadline" tags "-DEADLINE={.+}-SCHEDULED={.+}/!+TODO")))
#+end_src
** automatically pull when opening roam file
#+begin_src emacs-lisp
(defun ben/org-roam-pull ()
  "Pull from the git repository's upstream."
  (let ((default-directory org-roam-directory))
    (shell-command "git pull --ff-only")))

(add-hook 'org-roam-find-file-hook #'ben/org-roam-pull)
#+end_src
** ~org-recur~
#+begin_src emacs-lisp
(use-package! org-recur
  :demand t
  :hook ((org-mode . org-recur-mode)
         (org-agenda-mode . org-recur-agenda-mode))

  :custom
  (org-recur-finish-done t)
  (org-recur-finish-archive t)

  :config
  (define-key org-recur-mode-map (kbd "C-c d") 'org-recur-finish)
  ;; Rebind the 'd' key in org-agenda (default: `org-agenda-day-view').
  (define-key org-recur-agenda-mode-map (kbd "d") 'org-recur-finish)
  (define-key org-recur-agenda-mode-map (kbd "C-c d") 'org-recur-finish))

#+end_src
*** Refresh org-agenda whenever a task is rescheduled
#+begin_src emacs-lisp
(defun org-agenda-refresh ()
  "Refresh all `org-agenda' buffers."
  (dolist (buffer (buffer-list))
    (with-current-buffer buffer
      (when (derived-mode-p 'org-agenda-mode)
        (org-agenda-maybe-redo)))))

(defadvice org-schedule (after refresh-agenda activate)
  "Refresh org-agenda."
  (org-agenda-refresh))
#+end_src
*** Keep task metadata clean
#+begin_src emacs-lisp
;; Log time a task was set to DONE.
(setq org-log-done (quote time))

;; Don't log the time a task was rescheduled or redeadlined.
(setq org-log-redeadline nil)
(setq org-log-reschedule nil)
#+end_src
*** Prefer rescheduling to future times & dates
#+begin_src emacs-lisp
(setq org-read-date-prefer-future 'time)
#+end_src
** ~org-vulpea~
#+begin_src emacs-lisp
(use-package! vulpea
  :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-enable))
  :demand t)
#+end_src
** ~org-cliplink~
#+begin_src emacs-lisp
(use-package! org-cliplink
  :config
  (global-set-key (kbd "C-c l") 'org-cliplink))
#+end_src
** ~org-krita~
#+begin_src emacs-lisp
(use-package! org-krita
  :hook (org-mode . org-krita-mode))
#+end_src
** ~org-appear~
#+begin_src emacs-lisp
(use-package! org-appear
  :custom
  (org-hide-emphasis-markers t)
  (org-appear-autoemphasis t)
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t)
  (org-appear-autokeywords t)
  (org-appear-inside-latex t)
  :hook (org-mode . org-appear-mode))
#+end_src
** ~org-contacts~
#+begin_src emacs-lisp
(use-package! org-contacts
  :after org
  :custom
  (org-contacts-files `(,(concat ben/org-dir "/contacts.org"))))
#+end_src
** Citations
*** CANC ~citar~
#+begin_src emacs-lisp :tangle no
(use-package! citar
  :custom
  (org-cite-global-bibliography `(,ben/bib))
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  (citar-at-point-function 'embark-act)
  (citar-bibliography org-cite-global-bibliography)
  (citar-library-paths `(,ben/papers))
  ;; Icons
  (citar-symbols
   `((file ,(all-the-icons-faicon "file-o" :face 'all-the-icons-green :v-adjust -0.1) . " ")
     (note ,(all-the-icons-material "speaker_notes" :face 'all-the-icons-blue :v-adjust -0.3) . " ")
     (link ,(all-the-icons-octicon "link" :face 'all-the-icons-orange :v-adjust 0.01) . " ")))
  (citar-symbol-separator "  "))
#+end_src
*** ~org-ref~
#+begin_src emacs-lisp
(use-package! org-ref
  :custom
  (bibtex-completion-bibliography `(,ben/bib))
  (bibtex-completion-notes-path ben/notes)
  (bibtex-completion-library-path `(,ben/papers))
  (bibtex-completion-pdf-field "file")
  ;; helm configuration
  (org-ref-insert-link-function 'org-ref-insert-link-hydra/body)
  (org-ref-insert-cite-function 'org-ref-cite-insert-helm)
  (org-ref-insert-label-function 'org-ref-insert-label-link)
  (org-ref-insert-ref-function 'org-ref-insert-ref-link)
  (org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body))))
#+end_src
* ediff
#+begin_src emacs-lisp
(setq ediff-keep-variants nil
      ediff-split-window-function #'split-window-horizontally
      ediff-window-setup-function #'ediff-setup-windows-plain)
#+end_src
* LaTeX
** hooks
#+begin_src emacs-lisp
(add-hook! 'LaTeX-mode-hook '(#'olivetti-mode #'display-line-numbers-mode #'TeX-source-correlate-mode #'outline-minor-mode))
#+end_src
** latexmk
#+begin_src emacs-lisp
(use-package! auctex-latexmk
  :config (auctex-latexmk-setup))
#+end_src
* mu4e
#+begin_src emacs-lisp
(setq mu4e-change-filenames-when-moving t)
#+end_src
* appearance
** doom modeline
#+begin_src emacs-lisp
(setq doom-modeline-enable-word-count t)
#+end_src
** ~zoom~
#+begin_src emacs-lisp
(use-package! zoom
  :config (zoom-mode))
#+end_src
** olivetti
#+begin_src emacs-lisp
(use-package! olivetti
  :commands (olivetti-mode))
#+end_src
** blinking cursor
#+begin_src emacs-lisp
(blink-cursor-mode)
#+end_src
** theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
#+end_src
** line numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src
** fonts
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Fira Code" :size 16)
      doom-variable-pitch-font (font-spec :family "Libertinus Serif" :size 20))
#+end_src
#+begin_src emacs-lisp
(use-package! mixed-pitch
  :custom (mixed-pitch-set-height t)
  :config
  (setq mixed-pitch-fixed-pitch-faces (append mixed-pitch-fixed-pitch-faces '(org-column org-column-title treemacs-tags-face treemacs-file-face treemacs-root-face treemacs-directory-face)))
  ;; Default fonts
  ;; (set-face-attribute 'default nil :family "Iosevka" :height 160)
  ;; (set-face-attribute 'variable-pitch nil :family "Libertinus Serif" :height 1.2)
  ;; Size different org elements
  (set-face-attribute 'org-document-title nil :height 1.5)
  (set-face-attribute 'org-level-1 nil :height 1.3)
  (set-face-attribute 'org-level-2 nil :height 1.15)
  (set-face-attribute 'org-level-3 nil :height 1.075)
  (mixed-pitch-mode))
#+end_src
* dired
** ~dired-x~
#+begin_src emacs-lisp
(with-eval-after-load 'dired
  (require 'dired-x))
#+end_src
* editing
** ~yankpad~
#+begin_src emacs-lisp
(use-package yankpad
  :general (:prefix "C-c y"
            "m" 'yankpad-map
            "e" 'yankpad-expand
            "i" 'yankpad-insert
            "f" 'yankpad-edit
            "r" 'yankpad-reload))
#+end_src
** ~avy~
#+begin_src emacs-lisp
(after! avy
  (defun avy-action-embark (pt)
    (unwind-protect
        (save-excursion
          (goto-char pt)
          (embark-act))
      (select-window
       (cdr (ring-ref avy-ring 0))))
    t)
  (setf (alist-get ?. avy-dispatch-alist) 'avy-action-embark)
  (defun avy-action-helpful (pt)
    (save-excursion
      (goto-char pt)
      (helpful-at-point))
    (select-window
     (cdr (ring-ref avy-ring 0)))
    t)
  (setf (alist-get ?H avy-dispatch-alist) 'avy-action-helpful))
#+end_src
** ~re-builder~
Remove the “backslash plague that haunts the default settings” ([[https://www.masteringemacs.org/article/re-builder-interactive-regexp-builder][Mastering Emacs: re-builder: the Interactive regexp builder]]).
#+begin_src emacs-lisp
(setq reb-re-syntax 'string)
#+end_src
** ~ctrlf~
#+begin_src emacs-lisp
(use-package! ctrlf
  :config (ctrlf-mode))
#+end_src
** ~typo~
#+begin_src emacs-lisp
(use-package! typo
  :config (typo-global-mode)
  :hook (text-mode . typo-mode))
#+end_src
** evil
#+begin_src emacs-lisp
(setq evil-org-special-o/O '(table-row item))
#+end_src
*** ~evil-mc~
#+begin_src emacs-lisp
(use-package! evil-mc
  :config
  (global-evil-mc-mode)
  (add-to-list 'evil-mc-incompatible-minor-modes 'typo-mode))
#+end_src
* hydra
#+begin_src emacs-lisp
(use-package! hydra)
#+end_src
** Window management
#+begin_src emacs-lisp
(after! hydra
  (defhydra hydra-window-management ()
    "window"
    ("h" windmove-left "left")
    ("l" windmove-right "right")
    ("j" windmove-down "down")
    ("k" windmove-up "up")
    ("c" ace-window "change")
    ("C" ace-swap-window "swap")
    ("s" (progn (split-window-right) (windmove-right)) "split vertically")
    ("S" (progn (split-window-below) (windmove-down)) "split horizontally")
    ("[" my/move-splitter-left "adjust <-")
    ("]" my/move-splitter-right "adjust ->")
    ("=" my/move-splitter-up "adjust up")
    ("-" my/move-splitter-down "adjust down")
    ("b" balance-windows "balance")
    ("x" delete-window "delete")
    ("d" ace-delete-window "delete other")
    ("D" delete-other-windows "delete all others")
    ("q" nil "quit" :color blue)))
#+end_src
** Hunk Management
#+begin_src emacs-lisp
(after! hydra
  (defhydra hydra-hunk-management ()
    "hunk"
    ("h" (progn (goto-char (point-min)) (diff-hl-next-hunk)) "first")
    ("j" diff-hl-next-hunk "next")
    ("k" diff-hl-previous-hunk "prev")
    ("l" (progn (goto-char (point-max)) (diff-hl-previous-hunk)) "last")
    ("J" diff-hl-show-hunk-next "show next")
    ("L" diff-hl-show-hunk-previous "show prev")
    ("RET" diff-hl-show-hunk "show" :color blue)
    ("d" diff-hl-diff-goto-hunk "diff" :color blue)
    ("DEL" diff-hl-revert-hunk "revert")
    ("q" nil "quit" :color blue)))
#+end_src
* git
