home/files/doom/config.el

(after! org-agenda
  (add-to-list 'org-agenda-custom-commands
    '("u" "TODOs with no set schedule or deadline" tags "-DEADLINE={.+}-SCHEDULED={.+}/!+TODO")))

(defun ben/org-roam-pull ()
  "Pull from the git repository's upstream."
  (let ((default-directory org-roam-directory))
    (shell-command "git pull --ff-only")))

(add-hook 'org-roam-find-file-hook #'ben/org-roam-pull)

(use-package! org-recur
  :demand t
  :hook ((org-mode . org-recur-mode)
         (org-agenda-mode . org-recur-agenda-mode))

  :custom
  (org-recur-finish-done t)
  (org-recur-finish-archive t)

  :config
  (define-key org-recur-mode-map (kbd "C-c d") 'org-recur-finish)
  ;; Rebind the 'd' key in org-agenda (default: `org-agenda-day-view').
  (define-key org-recur-agenda-mode-map (kbd "d") 'org-recur-finish)
  (define-key org-recur-agenda-mode-map (kbd "C-c d") 'org-recur-finish))

(defun org-agenda-refresh ()
  "Refresh all `org-agenda' buffers."
  (dolist (buffer (buffer-list))
    (with-current-buffer buffer
      (when (derived-mode-p 'org-agenda-mode)
        (org-agenda-maybe-redo)))))

(defadvice org-schedule (after refresh-agenda activate)
  "Refresh org-agenda."
  (org-agenda-refresh))

;; Log time a task was set to DONE.
(setq org-log-done (quote time))

;; Don't log the time a task was rescheduled or redeadlined.
(setq org-log-redeadline nil)
(setq org-log-reschedule nil)

(setq org-read-date-prefer-future 'time)

(use-package! vulpea
  :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-enable))
  :demand t)

(use-package! org-cliplink
  :config
  (global-set-key (kbd "C-c l") 'org-cliplink))

(use-package! org-krita
  :hook (org-mode . org-krita-mode))

(use-package! org-appear
  :custom
  (org-hide-emphasis-markers t)
  (org-appear-autoemphasis t)
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t)
  (org-appear-autokeywords t)
  (org-appear-inside-latex t)
  :hook (org-mode . org-appear-mode))

(use-package! org-contacts
  :after org
  :custom
  (org-contacts-files `(,(concat ben/org-dir "/contacts.org"))))

(use-package! org-ref
  :custom
  (bibtex-completion-bibliography `(,ben/bib))
  (bibtex-completion-notes-path ben/notes)
  (bibtex-completion-library-path `(,ben/papers))
  (bibtex-completion-pdf-field "file")
  ;; helm configuration
  (org-ref-insert-link-function 'org-ref-insert-link-hydra/body)
  (org-ref-insert-cite-function 'org-ref-cite-insert-helm)
  (org-ref-insert-label-function 'org-ref-insert-label-link)
  (org-ref-insert-ref-function 'org-ref-insert-ref-link)
  (org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body))))

(setq ediff-keep-variants nil
      ediff-split-window-function #'split-window-horizontally
      ediff-window-setup-function #'ediff-setup-windows-plain)

(add-hook! 'LaTeX-mode-hook '(#'olivetti-mode #'display-line-numbers-mode #'TeX-source-correlate-mode #'outline-minor-mode))

(use-package! auctex-latexmk
  :config (auctex-latexmk-setup))

(setq mu4e-change-filenames-when-moving t)

(setq doom-modeline-enable-word-count t)

(use-package! zoom
  :config (zoom-mode))

(use-package! olivetti
  :commands (olivetti-mode))

(blink-cursor-mode)

(setq doom-theme 'doom-one)

(setq display-line-numbers-type t)

(setq doom-font (font-spec :family "Fira Code" :size 16)
      doom-variable-pitch-font (font-spec :family "Libertinus Serif" :size 20))

(use-package! mixed-pitch
  :custom (mixed-pitch-set-height t)
  :config
  (setq mixed-pitch-fixed-pitch-faces (append mixed-pitch-fixed-pitch-faces '(org-column org-column-title treemacs-tags-face treemacs-file-face treemacs-root-face treemacs-directory-face)))
  ;; Default fonts
  ;; (set-face-attribute 'default nil :family "Iosevka" :height 160)
  ;; (set-face-attribute 'variable-pitch nil :family "Libertinus Serif" :height 1.2)
  ;; Size different org elements
  (set-face-attribute 'org-document-title nil :height 1.5)
  (set-face-attribute 'org-level-1 nil :height 1.3)
  (set-face-attribute 'org-level-2 nil :height 1.15)
  (set-face-attribute 'org-level-3 nil :height 1.075)
  (mixed-pitch-mode))

(with-eval-after-load 'dired
  (require 'dired-x))

(use-package yankpad
  :general (:prefix "C-c y"
            "m" 'yankpad-map
            "e" 'yankpad-expand
            "i" 'yankpad-insert
            "f" 'yankpad-edit
            "r" 'yankpad-reload))

(after! avy
  (defun avy-action-embark (pt)
    (unwind-protect
        (save-excursion
          (goto-char pt)
          (embark-act))
      (select-window
       (cdr (ring-ref avy-ring 0))))
    t)
  (setf (alist-get ?. avy-dispatch-alist) 'avy-action-embark)
  (defun avy-action-helpful (pt)
    (save-excursion
      (goto-char pt)
      (helpful-at-point))
    (select-window
     (cdr (ring-ref avy-ring 0)))
    t)
  (setf (alist-get ?H avy-dispatch-alist) 'avy-action-helpful))

(setq reb-re-syntax 'string)

(use-package! ctrlf
  :config (ctrlf-mode))

(use-package! typo
  :config (typo-global-mode)
  :hook (text-mode . typo-mode))

(setq evil-org-special-o/O '(table-row item))

(use-package! evil-mc
  :config
  (global-evil-mc-mode)
  (add-to-list 'evil-mc-incompatible-minor-modes 'typo-mode))

(use-package! hydra)

(after! hydra
  (defhydra hydra-window-management ()
    "window"
    ("h" windmove-left "left")
    ("l" windmove-right "right")
    ("j" windmove-down "down")
    ("k" windmove-up "up")
    ("c" ace-window "change")
    ("C" ace-swap-window "swap")
    ("s" (progn (split-window-right) (windmove-right)) "split vertically")
    ("S" (progn (split-window-below) (windmove-down)) "split horizontally")
    ("[" my/move-splitter-left "adjust <-")
    ("]" my/move-splitter-right "adjust ->")
    ("=" my/move-splitter-up "adjust up")
    ("-" my/move-splitter-down "adjust down")
    ("b" balance-windows "balance")
    ("x" delete-window "delete")
    ("d" ace-delete-window "delete other")
    ("D" delete-other-windows "delete all others")
    ("q" nil "quit" :color blue)))

(after! hydra
  (defhydra hydra-hunk-management ()
    "hunk"
    ("h" (progn (goto-char (point-min)) (diff-hl-next-hunk)) "first")
    ("j" diff-hl-next-hunk "next")
    ("k" diff-hl-previous-hunk "prev")
    ("l" (progn (goto-char (point-max)) (diff-hl-previous-hunk)) "last")
    ("J" diff-hl-show-hunk-next "show next")
    ("L" diff-hl-show-hunk-previous "show prev")
    ("RET" diff-hl-show-hunk "show" :color blue)
    ("d" diff-hl-diff-goto-hunk "diff" :color blue)
    ("DEL" diff-hl-revert-hunk "revert")
    ("q" nil "quit" :color blue)))
