home/files/doom/config.org
** ~magit-todos~
#+begin_src emacs-lisp
(use-package! magit-todos
   :config (magit-todos-mode))
#+end_src
** ~git-link~
#+begin_src emacs-lisp
(use-package! git-link
  :custom
  (git-link-open-in-browser t)
  :config
  (global-set-key (kbd "C-c g l") 'git-link))
#+end_src
* help
** ~democratize~
#+begin_src emacs-lisp
(use-package! democratize
  :demand t
  :config
  (democratize-enable-examples-in-help)
  (democratize-enable-examples-in-helpful))
#+end_src
