home/files/doom/config.el

(use-package! magit-todos
   :config (magit-todos-mode))

(use-package! git-link
  :custom
  (git-link-open-in-browser t)
  :config
  (global-set-key (kbd "C-c g l") 'git-link))

(use-package! democratize
  :demand t
  :config
  (democratize-enable-examples-in-help)
  (democratize-enable-examples-in-helpful))
